Ran test locally, confirmed working.

# main.tf
# Example 1: Create a policy definition
resource "azurerm_policy_definition" "test" {
  name         = "test-definition-version"
  policy_type  = "Custom"
  mode         = "All"
  display_name = "Test Definition Version Policy"

  metadata = jsonencode({
    version = "1.0.0"
  })

  policy_rule = jsonencode({
    if = {
      not = {
        field  = "location"
        equals = "westeurope"
      }
    }
    then = {
      effect = "Audit"
    }
  })
}

# Example 2: Test policy assignment with definition_version
data "azurerm_subscription" "current" {}

resource "azurerm_subscription_policy_assignment" "test" {
  name                 = "test-def-version"
  policy_definition_id = azurerm_policy_definition.test.id
  subscription_id      = data.azurerm_subscription.current.id
  
  # NEW FEATURE: Pin to specific version format
  definition_version = "1.0.*"  # Pin to version 1.0.x (any patch)
  
  # Alternatively, you can use:
  # definition_version = "1.*.*"   # Pin to version 1.x.x (any minor/patch)
  # definition_version = "1.0.0"   # Pin to exact version 1.0.0
}

# Example 3: Test data source reading definition_version
data "azurerm_policy_assignment" "test" {
  name     = azurerm_subscription_policy_assignment.test.name
  scope_id = data.azurerm_subscription.current.id
}

# Output to verify the definition_version is being read
output "assignment_definition_version" {
  value = data.azurerm_policy_assignment.test.definition_version
}


# output

terraform apply -auto-approve
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/azurerm in C:\gitRepos\go\terraform-provider-azurerm
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
data.azurerm_subscription.current: Reading...
data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/---------]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_policy_assignment.test will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_policy_assignment" "test" {
      + definition_version     = (known after apply)
      + description            = (known after apply)
      + display_name           = (known after apply)
      + enforce                = (known after apply)
      + id                     = (known after apply)
      + identity               = (known after apply)
      + location               = (known after apply)
      + metadata               = (known after apply)
      + name                   = "test-def-version"
      + non_compliance_message = (known after apply)
      + not_scopes             = (known after apply)
      + parameters             = (known after apply)
      + policy_definition_id   = (known after apply)
      + scope_id               = "/subscriptions/-------"
    }

  # azurerm_policy_definition.test will be created
  + resource "azurerm_policy_definition" "test" {
      + display_name        = "Test Definition Version Policy"
      + id                  = (known after apply)
      + metadata            = jsonencode(
            {
              + version = "1.0.0"
            }
        )
      + mode                = "All"
      + name                = "test-definition-version"
      + policy_rule         = jsonencode(
            {
              + if   = {
                  + not = {
                      + equals = "westeurope"
                      + field  = "location"
                    }
                }
              + then = {
                  + effect = "Audit"
                }
            }
        )
      + policy_type         = "Custom"
      + role_definition_ids = (known after apply)
    }

  # azurerm_subscription_policy_assignment.test will be created
  + resource "azurerm_subscription_policy_assignment" "test" {
      + definition_version   = "1.0.*"
      + enforce              = true
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "test-def-version"
      + policy_definition_id = (known after apply)
      + subscription_id      = "/subscriptions/-------"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + assignment_definition_version = (known after apply)
azurerm_policy_definition.test: Creating...
azurerm_policy_definition.test: Still creating... [00m10s elapsed]
azurerm_policy_definition.test: Still creating... [00m20s elapsed]
azurerm_policy_definition.test: Still creating... [00m30s elapsed]
azurerm_policy_definition.test: Still creating... [00m40s elapsed]
azurerm_policy_definition.test: Still creating... [00m50s elapsed]
azurerm_policy_definition.test: Still creating... [01m00s elapsed]
azurerm_policy_definition.test: Still creating... [01m10s elapsed]
azurerm_policy_definition.test: Still creating... [01m20s elapsed]
azurerm_policy_definition.test: Still creating... [01m30s elapsed]
azurerm_policy_definition.test: Creation complete after 1m34s [id=/subscriptions/------/providers/Microsoft.Authorization/policyDefinitions/test-definition-version]
azurerm_subscription_policy_assignment.test: Creating...
azurerm_subscription_policy_assignment.test: Still creating... [00m10s elapsed]
azurerm_subscription_policy_assignment.test: Still creating... [00m20s elapsed]
azurerm_subscription_policy_assignment.test: Still creating... [00m30s elapsed]
azurerm_subscription_policy_assignment.test: Still creating... [00m40s elapsed]
azurerm_subscription_policy_assignment.test: Still creating... [00m50s elapsed]
azurerm_subscription_policy_assignment.test: Still creating... [01m00s elapsed]
azurerm_subscription_policy_assignment.test: Still creating... [01m10s elapsed]
azurerm_subscription_policy_assignment.test: Still creating... [01m20s elapsed]
azurerm_subscription_policy_assignment.test: Still creating... [01m30s elapsed]
azurerm_subscription_policy_assignment.test: Still creating... [01m40s elapsed]
azurerm_subscription_policy_assignment.test: Creation complete after 1m41s [id=/subscriptions/-------/providers/Microsoft.Authorization/policyAssignments/test-def-version]
data.azurerm_policy_assignment.test: Reading...
data.azurerm_policy_assignment.test: Read complete after 0s [id=/subscriptions/-------/providers/Microsoft.Authorization/policyAssignments/test-def-version]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

assignment_definition_version = "1.0.*"